In [1]:
import pandas as pd
from dateutil.parser import parse, ParserError

In [11]:
customers = pd.read_csv("~/Desktop/Github_content/Module_5/Data/03_Library SystemCustomers.csv")
customers

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
3          NaN               NaN
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [12]:
# Delete empty rows
customers.dropna(inplace=True)
customers

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [ ]:
# Change Customer ID to INT 
customers['Customer ID'] = customers['Customer ID'].astype('Int32')
customers

   Customer ID     Customer Name
0            1          Jane Doe
1            2        John Smith
2            3        Dan Reeves
4            5    William Holden
5            6     Jaztyn Forest
6            7     Jackie Irving
7            8  Matthew Stirling
8            9         Emory Ted

In [177]:
book = pd.read_csv("~/Desktop/Github_content/Module_5/Data/03_Library Systembook.csv")
book.head()

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3.0
3,4.0,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4.0
4,5.0,Dune,"""02/04/2023""",25/03/2023,2 weeks,5.0

In [178]:
len(book)

114

In [179]:
# Create an errors df to keep a track of all dropped records
errors = pd.DataFrame(columns=book.columns)
errors

Empty DataFrame
Columns: [Id, Books, Book checkout, Book Returned, Days allowed to borrow, Customer ID]
Index: []

In [180]:
book[book.isna().any(axis=1)]

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
20,21.0,NaN,"""01/06/2023""",05/06/2023,2 weeks,NaN
21,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
109,NaN,NaN,NaN,NaN,NaN,NaN
110,NaN,NaN,NaN,NaN,NaN,NaN
111,NaN,NaN,NaN,NaN,NaN,NaN
112,NaN,NaN,NaN,NaN,NaN,NaN
113,NaN,NaN,NaN,NaN,NaN,NaN

In [181]:
def deNaN_dedupe(df, errors_df):
    # Move NaN rows to errors_df
    nan_rows = df[df.isna().any(axis=1)]
    errors_df = pd.concat([errors_df, nan_rows], ignore_index=True)
    df.dropna(inplace=True)

    # Move duplicated rows to errors_df
    dupe_rows = df[df.duplicated(keep='first')]
    errors_df = pd.concat([errors_df, dupe_rows], ignore_index=True)
    df.drop_duplicates(inplace=True)

    return df, errors_df

In [182]:
book, errors = deNaN_dedupe(book,errors)

C:\Users\Admin\AppData\Local\Temp\ipykernel_8332\1918042708.py:4: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  errors_df = pd.concat([errors_df, nan_rows], ignore_index=True)

In [183]:
# remove quotation marks from 'Book checkout' to enable date functionality
book['Book checkout'] = book['Book checkout'].str.replace('"','', regex=True)
book.head()

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,20/02/2023,25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,24/03/2023,21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,29/03/2023,25/03/2023,2 weeks,3.0
3,4.0,The hobbit,02/04/2023,25/03/2023,2 weeks,4.0
4,5.0,Dune,02/04/2023,25/03/2023,2 weeks,5.0

In [184]:
def is_valid_date(date):
    # This function parses a date to see whether it is valid
    if not date:
        return False
    try:
        parse(date)
        return True
    except ParserError:
        return False

In [85]:
if book['Book checkout'].apply(lambda x: is_valid_date(x))

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16    False
17     True
18     True
19     True
Name: Book checkout, dtype: bool

In [111]:
# Drop row 16 due to invalid date
book.drop(16, inplace=True)

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,20/02/2023,25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,24/03/2023,21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,29/03/2023,25/03/2023,2 weeks,3.0
3,4.0,The hobbit,02/04/2023,25/03/2023,2 weeks,4.0
4,5.0,Dune,02/04/2023,25/03/2023,2 weeks,5.0
5,6.0,Little Women,02/04/2023,01/05/2023,2 weeks,1.0
6,7.0,IT,10/04/2063,03/04/2023,2 weeks,6.0
7,8.0,Misery,15/04/2023,03/04/2023,2 weeks,7.0
8,9.0,Catch 22,15/04/2023,16/04/2023,2 weeks,7.0
9,10.0,Animal Farm,20/04/2023,24/04/2023,2 weeks,2.0
10,11.0,1984,23/04/2023,27/04/2023,2 weeks,8.0
11,12.0,Little Women,02/04/2023,01/05/2023,2 weeks,1.0
12,13.0,East of Eden,30/04/2023,05/05/2023,2 weeks,2.0
13,14.0,America Is in the Heart,01/05/2023,07/05/2023,2 weeks,3.0
14,15.0,Wuthering Heights,01/05/2023,10/05/2023,2 weeks,9.0
15,16.0,Dark Tales,15/05/2023,01/06/2023,2 weeks,2.0
17,18.0,Les Miserables,03/06/2023,07/06/2023,2 weeks,5.0
18,19.0,Dracula,10/06/2023,10/07/2023,2 weeks,10.0
19,20.0,Frankenstein,01/06/2023,20/06/2023,2 weeks,2.0

In [114]:
# Convert date columns to datetime
book['Book checkout'] = pd.to_datetime(book['Book checkout'], dayfirst=True)
book['Book Returned'] = pd.to_datetime(book['Book Returned'], dayfirst=True)

In [115]:
# Change IDs to int
book['Customer ID'] = book['Customer ID'].astype('Int32')
book['Id'] = book['Id'].astype('Int32')

In [116]:
def loan_time(df, date1, date2):
    df['Loan Days'] = df[date2] - df[date1]

In [117]:
loan_time(book,'Book checkout','Book Returned')
book

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID,Loan Days
0,1,Catcher in the Rye,2023-02-20,2023-02-25,2 weeks,1,5 days
1,2,Lord of the rings the two towers,2023-03-24,2023-03-21,2 weeks,2,-3 days
2,3,Lord of the rings the return of the kind,2023-03-29,2023-03-25,2 weeks,3,-4 days
3,4,The hobbit,2023-04-02,2023-03-25,2 weeks,4,-8 days
4,5,Dune,2023-04-02,2023-03-25,2 weeks,5,-8 days
5,6,Little Women,2023-04-02,2023-05-01,2 weeks,1,29 days
6,7,IT,2063-04-10,2023-04-03,2 weeks,6,-14617 days
7,8,Misery,2023-04-15,2023-04-03,2 weeks,7,-12 days
8,9,Catch 22,2023-04-15,2023-04-16,2 weeks,7,1 days
9,10,Animal Farm,2023-04-20,2023-04-24,2 weeks,2,4 days
10,11,1984,2023-04-23,2023-04-27,2 weeks,8,4 days
11,12,Little Women,2023-04-02,2023-05-01,2 weeks,1,29 days
12,13,East of Eden,2023-04-30,2023-05-05,2 weeks,2,5 days
13,14,America Is in the Heart,2023-05-01,2023-05-07,2 weeks,3,6 days
14,15,Wuthering Heights,2023-05-01,2023-05-10,2 weeks,9,9 days
15,16,Dark Tales,2023-05-15,2023-06-01,2 weeks,2,17 days
17,18,Les Miserables,2023-06-03,2023-06-07,2 weeks,5,4 days
18,19,Dracula,2023-06-10,2023-07-10,2 weeks,10,30 days
19,20,Frankenstein,2023-06-01,2023-06-20,2 weeks,2,19 days